<?php
/**+----------------------------------------------------------------------
 * JamesPi Redis [php-redis]
 * +----------------------------------------------------------------------
 * KafKa Service Configuration file
 * +----------------------------------------------------------------------
 * Copyright (c) 2020-2030 http://www.pijianzhong.com All rights reserved.
 * +----------------------------------------------------------------------
 * Author：PiJianZhong <jianzhongpi@163.com>
 * +----------------------------------------------------------------------
 */

return [
    'Basic' =>[
        'host' => '192.168.109.53',
        'port' => '9092'
    ],
    /** 生产端 **/
    'is_async' => false, //是否同步模式【系统默认同步开启,若无特殊需求可不必写入】
    'produce_interval_time' =>100, //异步生成消息时执行生产消息请求的时间间隔
    'refresh_interval_time' => 10000, //主题元数据刷新间隔（以毫秒为单位）。错误时元数据会自动刷新并连接。使用-1禁用间隔刷新。
    'broker_version' => '0.10.1.0',
    'required_ack' => 1, //消息确认模式【0，1，-1】
    'batch_number' => 1, //批量发送次数【单条发送为1】
    'topic' => 'test', //选择主题
    'msg' => ['test....message00.', 'test....message01.', 'test....message03.'], //批量发送消息体
    'key' => '',
    /** 消费端 **/
    'group_id' => '', //客户端组ID字符串。共享相同group.id的所有客户端都属于同一组
    'topics' => [], //想要消费者主题
];